MENU_CONTACT_LIST_INPUT_FIO = (
    'Введи имя или должность нужного коллеги, и я пришлю тебе его контакты.'
)
MENU_CONTACT_LIST_LOAD_CONTACT_LIST = (
    'Если хочешь скачать справочник с контактами коллег, '
    'нажми на ссылку ниже.'
)

# Константы для поиска коллег по ключевым словам

NO_CONTACTS_FOUND = 'По твоему запросу контакты коллег не найдены'

CONTACTS_FOUND = 'По твоему запросу найдены коллеги:'

MORE_THAN_MAX_CONTACTS_FOUND = (
    'и некоторые другие - постарайся использовать более точные запросы'
)

SEARCH_AGAIN_OR_EXIT = (
    'Можешь ввести поисковый запрос еще раз '
    'или нажать кнопку ниже для '
    'возврата в главное меню'
)
