ONBOARDING_MENU = (
    'Мы хотим, чтобы знакомство с Фондом прошло для тебя максимально комфотно,'
    ' поэтому в Фонде действует <a href="https://drive.google.com/file/d/'
    '16x6GGaydUd3LGs23Fkqes-7SJGMqCFjy/view?usp=sharing">'
    'система адаптации новых сотрудников</a>. '
    'Она заключается в том, что у каждого новичка есть свой наставник.'
    'Наставник - это сотрудник из твоего подразделения, который передает свои'
    'знания и опыт, а также помогает освоиться в Фонде и поддерживает. Иногда'
    'в роли наставника может выступать сам руководитель. В таком случае '
    'освоиться на месте и не запутаться в организационных вопросах поможет '
    'buddy - коллега, с которым можно выпить кофе и получить дружескую '
    'поддержку.'
    '\Какая у тебя роль в онбординге?'
)
