ONBOARDING_LINK = (
    'https://drive.google.com/file/d/'
    '16x6GGaydUd3LGs23Fkqes-7SJGMqCFjy/view?usp=sharing'
)
ONBOARDING_MENU = (
    'Мы хотим, чтобы знакомство с Фондом прошло для тебя максимально комфотно,'
    ' поэтому в Фонде действует '
    f'[система адаптации новых сотрудников]({ONBOARDING_LINK})\\.'
    ' Она заключается в том, что у каждого новичка есть свой наставник\\.'
    ' Наставник \\-\\ это сотрудник из твоего подразделения, который передает '
    'свои знания и опыт, а также помогает освоиться в Фонде и поддерживает\\.'
    ' Иногда в роли наставника может выступать сам руководитель\\. В таком '
    'случае освоиться на месте и не запутаться в организационных вопросах '
    'поможет buddy \\-\\ коллега, с которым можно выпить кофе и получить '
    'дружескую поддержку\\.\n'
    '\nКакая у тебя роль в онбординге?'
)

MENTOR = (
    'Как здорово, что ты согласился быть наставником/бадди для новичка\\!🤗'
    '\nДавай расскажу, что надо делать в этой роли?'
)

TASKS_FOR_MENTOR = (
    'Задачи наставника по отношению к новым сотрудникам:\n'
    '1\\. Рассказ о функциях подразделения и знакомство новичка с коллективом'
    ' \\(с кем человеку придется общаться, к кому обращаться за помощью в тех'
    ' или иных случаях\\)\\.\n'
    '2\\. Разъяснение норм внутренних коммуникаций, принятых правил делового '
    ' этикета\\.\n'
    '3\\. Знакомство с содержанием функциональных обязанностей, подготовленных'
    ' руководителем\\.\n'
    '4\\. Обучение работе в корпоративной CRM/базах данных/гугл диске\\.\n'
    '5\\. Предоставление обратной связи, которая является инструментом '
    'развития новичка\\.\n'
    '6\\. Эмоциональная поддержка новичка во время всего периода '
    'адаптации \\-\\ неформальные беседы/встречи/совместный обед '
    '\\(роль Бадди\\)\\. Иногда эту роль выполняет отдельный сотрудник, '
    'который может быть никак не связан рабочими задачами с новичком\\.'
)
