ONBOARDING_LINK = (
    'https://drive.google.com/file/d/'
    '16x6GGaydUd3LGs23Fkqes-7SJGMqCFjy/view?usp=sharing'
)

ONBOARDING_LINK_FORM = (
    'https://docs.google.com/forms/d/e/'
    '1FAIpQLScg142_kukGejpLHsMIWiVPVqSbCQNP2i_HzAbW6jvlsZEG2A/'
    'formrestricted'
)

START_MEETING_LINK = (
    'https://docs.google.com/spreadsheets/d/'
    '17HJ_jf9ypoXZiG4g3qSLRcaj5y5pZx0XwZ7k0W3HZus/edit?usp=sharing'
)

CHECK_LIST_LINK = (
    'https://docs.google.com/spreadsheets/d/'
    '1TpQ52IdyUG4Hv11viT5kLbznkIC61uhQDNbLax2P3Xk/edit?usp=sharing'
)

WORK_PLAN_LINK = (
    'https://docs.google.com/spreadsheets/d/'
    '17HJ_jf9ypoXZiG4g3qSLRcaj5y5pZx0XwZ7k0W3HZus/edit?usp=sharing'
)

TASK_PLAN_LINK = (
    'https://docs.google.com/spreadsheets/d/'
    '17HJ_jf9ypoXZiG4g3qSLRcaj5y5pZx0XwZ7k0W3HZus/edit?usp=sharing'
)

PROBATION_PLAN_LINK = (
    'https://docs.google.com/spreadsheets/d/'
    '17HJ_jf9ypoXZiG4g3qSLRcaj5y5pZx0XwZ7k0W3HZus/edit?usp=sharing'
)

ONBOARDING_MENU = (
    'Мы хотим, чтобы знакомство с Фондом прошло для тебя максимально комфотно,'
    ' поэтому в Фонде действует '
    f'[система адаптации новых сотрудников]({ONBOARDING_LINK})\\.'
    ' Она заключается в том, что у каждого новичка есть свой наставник\\.'
    ' Наставник \\-\\ это сотрудник из твоего подразделения, который передает '
    'свои знания и опыт, а также помогает освоиться в Фонде и поддерживает\\.'
    ' Иногда в роли наставника может выступать сам руководитель\\. В таком '
    'случае освоиться на месте и не запутаться в организационных вопросах '
    'поможет buddy \\-\\ коллега, с которым можно выпить кофе и получить '
    'дружескую поддержку\\.\n'
    '\n*Какая у тебя роль в онбординге?*'
)

MENTOR = (
    'Как здорово, что ты согласился быть наставником/бадди для новичка!🤗'
    '\nДавай расскажу, что надо делать в этой роли?'
)

MENTOR_TASKS = (
    '*Задачи наставника по отношению к новым сотрудникам:*\n'
    '1\\. Рассказ о функциях подразделения и знакомство новичка с коллективом'
    ' \\(с кем человеку придется общаться, к кому обращаться за помощью в тех'
    ' или иных случаях\\)\\.\n'
    '2\\. Разъяснение норм внутренних коммуникаций, принятых правил делового '
    ' этикета\\.\n'
    '3\\. Знакомство с содержанием функциональных обязанностей, подготовленных'
    ' руководителем\\.\n'
    '4\\. Обучение работе в корпоративной CRM/базах данных/гугл диске\\.\n'
    '5\\. Предоставление обратной связи, которая является инструментом '
    'развития новичка\\.\n'
    '6\\. Эмоциональная поддержка новичка во время всего периода '
    'адаптации \\-\\ неформальные беседы/встречи/совместный обед '
    '\\(роль Бадди\\)\\. Иногда эту роль выполняет отдельный сотрудник, '
    'который может быть никак не связан рабочими задачами с новичком\\.'
)

BEGINNER_START_MESSAGE_ONE = (
    'Здорово, что ты с нами команде! Поздравляем! '
    'Значит, мы мыслим в одном направлении и вместе будем '
    'делать этот мир лучше!💖'
)

BEGINNER_START_MESSAGE_TWO = (
    '*Напиши, пожалуйста, дату твоего первого рабочего дня*'
)

BEGINNER_EMPLOYMENT_MESSAGE_ONE = (
    'Супер! Надеюсь, первые три месяца в фонде будут для тебя вдохновляющими '
    'и продуктивными! Я буду периодически узнавать у тебя, как ты себя '
    'чувствуешь на новом месте. Ну что, поехали дальше?'
)

BEGINNER_EMPLOYMENT_MESSAGE_TWO = (
    '*Выбери из меню, о чем ты хочешь узнать подробнее*'
)

BEGINNER_AFTER_25_DAY_MESSAGE = (
    'Привет! Скоро будет месяц, как ты с нами!😊 '
    'Расскажи, какие у тебя впечатления от работы? '
    'Твой отзыв очень ценен для нас, ведь так мы сможем сделать онбординг '
    'еще лучше:) А если у тебя есть идеи и предложения по системе адаптации, '
    'смело пиши их в строке ввода😉'
)

BEGINNER_AFTER_40_DAY_MESSAGE = (
    'Привет! Как летит время! Ты уже почти два '
    'месяца в команде! Как проходит адаптация? '
    'Твой отзыв очень ценен для нас, ведь так мы сможем сделать онбординг '
    'еще лучше:) А если у тебя есть идеи и предложения по системе адаптации, '
    'смело пиши их в строке ввода😉'
)

BEGINNER_AFTER_85_DAY_MESSAGE = (
    'Привет! До окончания адаптации осталось '
    'совсем чуть-чуть😊 Как твои дела? '
    'Твой отзыв очень ценен для нас, ведь так мы сможем сделать онбординг '
    'еще лучше:) Мы будем благодарны если ты найдешь время заполнить '
    f'[анкету по итогам адаптации]({ONBOARDING_LINK_FORM}) '
)

BEGINNER_FIRST_DAY_MESSAGE_ONE = (
    'Ура! Первый день в Фонде! Скорее всего он будет очень насыщенным и '
    'интересным. Чтобы не потеряться в обилии информации, обычно мы '
    'высылаем welcome-письмо нашим новым коллегам с примерным планом на '
    'первый день.'
)

BEGINNER_FIRST_DAY_MESSAGE_TWO = (
    'Обычно он выглядит так:\n'
    '*\\- Встреча с HR\\-менеджером\\.* На этой встрече мы расскажем, как у '
    'нас происходит онбординг, какая корпоративаная культура, средства '
    'коммуникации и прочее\\.\n'
    '*\\- Оформление на работу\\.* В бухгалтерии подготовят все необходимые '
    'документы, которые надо будет подписать через систему кадрового '
    'электронного документооборота\\.\n'
    '*\\- Встречи с твоим непосредстенным руководителем и наставником*, на '
    'которой вы вместе заполните '
    f'[план на испытательный срок]({PROBATION_PLAN_LINK}) и поговорите '
    'об основных задачах\\.\n'
)

BEGINNER_FIRST_DAY_MESSAGE_THREE = (
    '*Твои основные задачи на первый день описаны в чек\\-листе '
    'новичка\\. Прислать ссылку?*'
)

BEGINNER_STAGES_ADAPTATION_MESSAGE_ONE = (
    'Система онбординга в Фонде подразумевает серию встреч между новичком '
    'и руководителем/наставником\\.\n'
    '\n*Стартовая встреча* происходит обычно в первый рабочий день\\. На '
    'ней вы вместе с руководителем/наставником можете обсудить цели '
    'испытательного срока, удобное время для встреч, а также занести их в '
    'google\\-календарь, чтобы не забыть\\. Обычно в первый день также '
    'обсуждается твой '
    f'[план\\-задач на испытательный срок]({TASK_PLAN_LINK})\\.\n'
    '\n*Вторая встреча* проводится по итогам первого месяца в Фонде\\. На '
    'ней вместе с руководителем обсуждаются первые результаты работы\\. '
    'Будет здорово также услышать от тебя предложения, что и как можно '
    'сделать лучше\\.\n'
    '\n*Третья встреча* \\-\\ экватор испытательного срока\\. На ней важно'
    ' актуализировать задачи в плане работы, обменяться обратной связью, '
    'выявить трудности, обсудить промежуточные результаты и дальнейшее '
    'обучение\\.\n'
    '\n*Завершающая встреча* проводится за неделю до окончания '
    'испытательного срока вместе с руководителем, и на ней подводятся '
    'итоги адаптации\\.\n'
)

BEGINNER_STAGES_ADAPTATION_MESSAGE_TWO = (
    'Если ты в Москве, то помимо встреч, тебя ждет также экскурсия по '
    'нашему центру сортировки, а также ознаокмительная поездка в Кострому '
    'к нашим коллегам в центр сртировки и переаботки и центр выдачи '
    'гуманитарной помощи.'
)

BEGINNER_STAGES_ADAPTATION_MESSAGE_THREE = (
    'На протяжении всего периода адаптации не бойся задавать вопросы, быть'
    ' инициативным и предлогать идеи/улучшения. МЫ любим открытость и '
    'энтузиазм, поэтому твои вопросы для нас - показатель твоей '
    'заинтересованности.'
)

BEGINNER_STAGES_ADAPTATION_MESSAGE_FOUR = (
    '*Показать, как выглядит форма плана работы на испытательный срок?*'
)

BEGINNER_WORK_PLAN_MESSAGE_ONE = (
    f'[План работы на испытательный срок]({WORK_PLAN_LINK})\\-\\ это '
    'перечень задач со сроком их исполнения, которые нужно выполнить в '
    'течение испытательного срока \\(3 месяца\\)\\. Это очень удобный '
    'инструмент, который помогает не отходить от заданного курса работы и '
    'будет служить тебе ориентиром в первые месяцы\\.'
)

BEGINNER_CHECK_LIST_MESSAGE_ONE = (
    f'Лови [чек\\-лист нового сотрудника]({CHECK_LIST_LINK})\\. В нем  '
    'проверочный список базовых задач на период адаптации, чтобы ничего '
    'не забыть :\\)'
)

BEGINNER_DEFERRED_MESSAGES_VARIANTS = (
    'Записал\\! Спасибо за ответ\\! У тебя уже '
    'назначена встреча по итогам '
    'первого месяца с руководителем? '
)

CALENDAR_DEFERRED_MESSAGES_VARIANTS_YES = (
    'Отлично\\! Скоро пришлю тебе '
    'напоминание о следующей встрече\\! '
    'Хорошего дня\\! '
)

CALENDAR_DEFERRED_MESSAGES_VARIANTS_NO = (
    'Не забудь поставить встречу в '
    'календарь, чтобы свериться с '
    'планом и обменяться обратной '
    'связью с коллегой '
)

DIRECTOR = {
    'msg_1': (
        'Если в твоей команде новый сотрудник, я могу присылать тебе '
        'напоминания о необходимости назначить встречу с новичком.'
    ),
}

DIRECTOR_TASKS = (
    '*Задачи руководителя при онбординге:*\n'
    '1\\. Определение должностных обязанностей\\. Актуализация обязанностей в '
    'должностной инструкции при необходимости\\.\n'
    '2\\. Постановка целей и задач на период испытательного срока, определение'
    ' содержания работы на это время \\-\\ новый сотрудник должен четко '
    'понимать, по каким критериям его будут оценивать после того, как '
    'испытательный срок окончиться\\.\n'
    '3\\. Рассказ новичку о принципах коммуникации, его зоне ответственности и'
    ' правилах взаимодействия с руководителем и отделом\\.\n'
    '4\\. Ознакомление нового сотрудника с содержанием плана на испытательный '
    'срок и разъяснение назначения запланированных мероприятий, установка '
    'сроков исполнения задач\\.\n'
    '5\\. Определение наставника из числа специалистов отдела\\.\n'
    '6\\. Отслеживание промежуточных результатов\\. Важно избегать ситуации, '
    'когда сотрудника оставляют без конроля на весь испытательный срок, в '
    'конце которого фактические результаты его деятельности расходятся с '
    'запланированными\\. Хотя бы раз в месяц необходимо беседовать с новым '
    'работником о том, каких успехов он достиг и с какими сложностями '
    'сталкивается\\.\n'
    '7\\. Оценка выполненных заданий, проведение оценочных мероприятий для '
    'проверки приобретенных знаний в случае обучения сотрудника во время '
    'адаптационного периода\\.\n'
    '8\\. Принятие решения отностительно работы нового сотрудника в Фонде\\.'
)

DATA_MESSAGE_FOR_NEW_WORKER = (
    'Напиши пожалуйста, дату приема нового сотрудника'
)

DIRECTOR_AFTER_25_DAY_MESSAGE = (
    'Привет! Сегодня месяц, как в твоем отделе новый '
    'сотрудник. Вы уже назначили встречу по итогам '
    'первого месяца? '
)

DIRECTOR_AFTER_40_DAY_MESSAGE = (
    'Привет! Уже почти два месяца, '
    'как в твоем отделе новый сотрудник. '
    'Вы уже назначили встречу по итогам 2-х месяцев? '
)

DIRECTOR_AFTER_85_DAY_MESSAGE = (
    'Привет! Уже почти три месяца, '
    'как в твоем отделе новый сотрудник. '
    'Вы уже назначили встречу по итогам 3-х месяцев? '
)

DIRECTOR_DEFERRED_MESSAGES_VARIANTS_YES = (
    'Отлично\\! Скоро пришлю тебе '
    'напоминание о следующей встрече\\! '
    'Хорошего дня\\! '
)

DIRECTOR_DEFERRED_MESSAGES_VARIANTS_NO = (
    'Не забудь поставить встречу в '
    'календарь, чтобы свериться с '
    'планом и обменяться обратной '
    'связью с коллегой '
)

MEETINGS_MESSAGE_FOR_DIRECTOR = (
    'Система онбординга в Фонде подразумевает серию встреч между новичком и '
    'руководителем/наставником\\.\n'
    '\n*Стартовая встреча* происходит обычно в первый рабочий день\\. На ней '
    'вы вместе с новичком можете обсудить цели испытательного срока, удобное '
    'время для встреч, а также занести их в google\\-календарь, чтобы не '
    'забыть\\. Обычно в первый день также обсуждается '
    f'[план задач на испытательный срок]({START_MEETING_LINK})\\.\n'
    '\n*Вторая встреча* проводится по итогам первого месяца в Фонде\\. На ней'
    ' вместе с новичком обсуждаются первые результаты работы\\. Важно'
    ' похвалить сотрудника за положительные результаты работы, предложить, '
    'что и как можно сделать лучше\\.\n'
    '\n*Третья встреча* \\-\\ экватор испытального срока\\. На ней важно '
    'актуализировать задачи в плане работы, обменяться обратной связью, '
    'выявить трудности, обсудить промежуточные результаты и дальнейшее '
    'обучение\\. Необходимо в этот момент дать обратную связь по итогам работы'
    ' сотрудника\\.\n'
    'В случае неудовлетворительного результата работы \\-\\ либо указать на '
    'недостатки в работе, выявить трудности и помочь их преодолеть, либо '
    'принять решение о прекращении сотрудничества\\. Новому сотруднику должны '
    'быть понятны ошибки и способы их исправить\\.\n'
    '\n*Завершающая встреча* проводится за неделю до окончатия испытательного '
    'срока, и на ней подводятсяитоги адаптации\\. Если решение \\-\\ не '
    'сотрудничать, то сообщить, чего конкретно не хватило\\. Если продолжаете '
    'работу, то обсудить цели на ближайший период\\.'
)

REMINDER_MESSAGE_FOR_MEETINGS = {
    'msg_1': ('Готово\\! Обязательно напомню тебе о нужных встречах'),
}
