RULES_INFORMATION_MENU = (
    'В этом разделе собраны основные правила и договоренности '
    'внутри нашей команды.\n'
    '\nВыбирай нужный раздел, я все расскажу про все подробнее!'
)

COMMUNICATION = {
    'msg_1': (
        'Здесь я могу рассказать тебе основные\n'
        'правила внутренней и внешней коммуникации.'
    ),
    'msg_2': '*С чего начнем?*',
}

WORKSHOP = {
    'msg_1': (
        'Мастерская Фонда ВТОРОЕ ДЫХАНИЕ находится по '
        'адресу: ул. Годовикова, 6. Чтобы в неё попасть, нужен ключ, так '
        'что если ты собираешься приехать в мастерскую пораньше, '
        'лучше не забыть предварительно спросить коллег, открыт ли '
        'офис. А если ключ у тебя уже есть, то не забудь при входе снять '
        'помещение с сигнализации. Иначе к нам приедет охрана и будет '
        'задавать вопросы. Как снять офис с сигнализации, тебе расскажет '
        'администратор.'
    ),
    'msg_2': (
        'В мастерской проходят различные мероприятия и '
        'мастер-классы, повсюду царит атмосфера креатива и творчества, '
        'поэтому очень важно не трогать рабочий инвентарь, чтобы '
        'ничего не потерялось.'
    ),
    'msg_3': (
        'Важно помнить, что мастерская - это открытое '
        'пространство, и мы просим не обсуждать рабочие вопросы в '
        'присутствии посторонних людей, не оставлять в общественных '
        'зонах юридически важную информацию.'
    ),
    'msg_4': (
        'В мастерскую можно приводить собаку, если вы '
        'можете следить за ней в течение дня. Если у вас аллергия, об '
        'этом важно сказать руководителю, чтобы другие люди с '
        'собаками учитывали это, если планируют приехать.🐶❤️'
    ),
    'msg_5': (
        'Если вы уходите из мастерской последним, не '
        'забудьте выключить свет, закрыть и занавесить все окна и '
        'поставить мастерскую на сигнализацию\\.'
    ),
}

KITCHEN = (
    'Наш офис оборудован обеденной зоной\\. Мы '
    'просим тебя обедать в специально отведённых '
    'для этого местах, не оставлять на рабочем столе '
    'кружки или посуду, а также убирать за собой и '
    'своевременно мыть посуду\\. Не допускай '
    'хранения просроченных продуктов в общем '
    'холодильнике\\. Если вдруг ты забыл обед, и '
    'переживаешь, что он испортится, то напиши в '
    'чат, и его спасут коллеги\\.🦸‍♂️🦸‍♀️'
)

SEPARATE_COLLECTION = (
    'Мы сортируем мусор, чтобы отправить его на '
    'дальнейшую переработку\\. Поэтому '
    'использованную пластиковую посуду нужно '
    'вымыть, просушить и положить в '
    'соответствующий контейнер \\(каждый контейнер '
    'имеет маркировку\\)\\.♻️'
)

REGULAR_MEETINGS = (
    'В Фонде есть традиция: в последнюю пятницу '
    'месяца мы устраиваем совместную встречу всей '
    'команды в google meet\\. На этих встречах мы '
    'делимся новостями, успехами и неуспехами '
    'в работе и благодарим коллег за помощь\\. Ссылка '
    'на встречи автоматически появляется у вас с календаре\\.\n'
    '\nПравила созвона простые:\n'
    '✅Включаем камеры\n'
    '✅Стараемся не быть многозадачными и '
    'избегаем анонсов \\(говорим только об итогах\\)\n'
    '✅Реакции и смайлики приветствуются\\)\n'
    'Соблюдаем тайминг \\-\\ выступления не '
    'дольше 5 минут\n'
    '✅Соблюдаем структуру:\n'
    '\\-\\ Представление \\(имя, должность, город\\)\n'
    '\\-\\ Рассказ "как прошел месяц": 3 значимых и '
    'успешных кейса и 1 провал \\(по желанию\\)\n'
    '\\-\\ Благодарность конкретным коллегам'
)

IN_COMMUNICATION = (
    '*Вот основные принципы внутренней коммуникации в Фонде:*\n'
    'Мы:\n'
    '_Обращаемся друг к другу на "ты"_\n'
    '_Правильно пишем темы писем в Gmail_\n'
    '_По возможности не используем аудиосообщения_\n'
    '_Обходим острые темы в корпоративных чатах_\n'
    '_Пишем отложенные сообщения после 19:00_\n'
    '_Не пишем коллегам по работе в их отпуск_\n'
    '_Не злоупотребляем гибким графиком работы_\n'
    '_Отвечаем на вопросы коллег прямо и понятно_\n'
    '_По личным вопросам пишем в личные сообщения, а не в общий чат_\n'
    '_Не частим в корпоративных чатах с мемами_'
)

OUT_COMMUNICATION = {
    'msg_1': (
        'Мы подготовили шпаргалку по пиару и коммуникациям в Фонде\\. '
        'Здесь ты найдешь ссылку на брендбук, презентации Фонда, фотографии, '
        'логотипы, правила оформления текста и '
        'ссылки на сервисы по проверке правописания, '
        'а также описание ролей сотрудников в пиар\\-отделе\\.\n'
        '\nСохраняй себе и пользуйся\\!'
    ),
}

RULES_LINK = (
    'https://www.notion.so/kozlovskikh/14953c96349b4c96a77c53a76637635c'
)
