STOP_MESSAGE = "Работа приложения остановлена."
HELP_MESSAGE = "Написать в поддержку"
START_MESSAGE = (
    "Привет! Меня зовут Втордыш,"
    "и я помощник сотрудников фонда ВТОРОЕ ДЫХАНИЕ. "
    "Я создан для того, чтобы помочь новеньким адаптироваться, "
    "но также буду полезен и опытным сотрудникам.\n"
    "Чтобы продолжить, введи секретное слово."
)
FAILED_THE_TEST = (
    "У нас другое секретное слово."
    "Попробуй ввести его еще раз "
    "или обратись в HR-отдел Фонда или на почту hr@vtoroe.ru."
)
PASSED_THE_TEST = (
    "Верно! Выбери интересующую тебя тему из списка "
    "в меню и я помогу тебе найти нужную информацию."
)
BACK_TO_THE_MENU = "Выбери интересующую тебя тему из списка:"
STICKER_ID: str = (
    "CAACAgIAAxkBAAIDwGUEItYpuU5DXDRigDA1M9SL-AdcAALTJAACHRAwSj-yFNWnj6hDMAQ"
)
BASIC_INFORMATION_MENU = (
    "В этом разделе мы собрали основную информацию о нашем Фонде.\n"
    "Выбирай нужный раздел, я расскажу про всё подробнее."
)
FUND_NEWS = (
    "Новости фонда\n"
    "Сайт фонда https://vtoroe.ru/\n"
    "Сайт магазинов https://shop.vtoroe.ru/\n"
    "Telegram фонда https://t.me/vtd_fond\n"
    "Telegram мастерской фонда https://t.me/vtoroemoscow\n"
    "Вконтакте фонда https://vk.com/vtd.fond\n"
)
OUR_TEAM_MESSAGE = (
    "У нас большая, дружная и сильная команда!"
    "Имена всех сотрудников с фотографиями можно найти "
    '<a href="https://vtoroe.ru/fond/people/">на нашем сайте</a>. '
    " Мы добавляем новых коллег на сайт после прохождения испытательного срока.\n"
    "\nТакже ты можешь посмотреть контакты всех сотрудников"
    ' в разделе "Список контактов" или почитать'
    ' об отделах Фонда в разделе "Отделы Фонда"'
)
# OUR_TEAM_SECOND_MESSAGE = (
#     'Также ты можешь посмотреть контакты всех сотрудников'
#     ' в разделе "Список контактов" или почитать'
#     ' об отделах Фонда в разделе "Отделы Фонда"'
# )
ORGANIZATION_MESSAGE = (
    "Как и в любой организации, в Фонде существует"
    ' <a href="https://docs.google.com/spreadsheets/d/1Wr8z0c1QtYvEl1nNX7oOt3LiaQ4ASNBhF2xxDDkpQs8/edit?usp=sharing">организационная структура</a>.'
    " Она состоит из совета, попечительского совета,"
    " директора, отделов и обособленных подразделений."
    " Головной офис фонда, мастерская, центр сортировки находятся в Москве,"
    " центр сортировки переработки, и центр гуманитарной выдачи – в г. Кострома."
    " Еще у Фонда есть склад в Ярославле.\n"
    "\nЕсли хочешь, я могу подробнее рассказать тебе о работе отделов или Совета."
)
