STOP_MESSAGE = 'Работа приложения остановлена.'
HELP_MESSAGE = 'Написать в поддержку'
START_MESSAGE = (
    'Привет! Меня зовут Втордыш,'
    'и я помощник сотрудников фонда ВТОРОЕ ДЫХАНИЕ. '
    'Я создан для того, чтобы помочь новеньким адаптироваться, '
    'но также буду полезен и опытным сотрудникам.\n'
    'Чтобы продолжить, введи секретное слово.'
)
MENU_CONTACT_LIST_INPUT_FIO = (
    'Введи ФИО или должность нужного коллеги, и я пришлю тебе его контакты.'
)
MENU_CONTACT_LIST_LOAD_CONTACT_LIST = (
    'Если ты хочешь скачать справочник с контактами коллег, '
    'нажми на ссылку внизу(ссылку добавим позже)'
)
