from bot.constants.links import FEEDBACK_LINK


STOP_MESSAGE = "Работа приложения остановлена."
HELP_MESSAGE = "Написать в поддержку"
START_MESSAGE = (
    "Привет! Меня зовут Втордыш,"
    "и я помощник сотрудников фонда ВТОРОЕ ДЫХАНИЕ. "
    "Я создан для того, чтобы помочь новеньким адаптироваться, "
    "но также буду полезен и опытным сотрудникам.\n"
    "Чтобы продолжить, введи секретное слово."
)
FAILED_THE_TEST = (
    "У нас другое секретное слово."
    "Попробуй ввести его еще раз "
    "или обратись в HR-отдел Фонда или на почту hr@vtoroe.ru."
)
PASSED_THE_TEST = (
    "Верно! Выбери интересующую тебя тему из списка "
    "в меню и я помогу тебе найти нужную информацию."
)
STICKER_ID: str = (
    "CAACAgIAAxkBAAIDwGUEItYpuU5DXDRigDA1M9SL-AdcAALTJAACHRAwSj-yFNWnj6hDMAQ"
)
FEEDBACK_MESSAGE: str = (
    'Мы сделали анонимную форму обратной связи для сотрудников Фонда — для '
    'тех, кто работает в бэк\-офисе, на складах в Москве и Костроме, '
    'в мастерской и в Центре гуманитарной выдачи\.\n\n'
    'Сообщить о проблеме, поделиться информацией или оставить иную обратную '
    'связь, если ты не хочешь сообщать ее лично, можно по '
    f'[ссылке]({FEEDBACK_LINK})\.'
)
