STOP_MESSAGE = "Работа приложения остановлена."
HELP_MESSAGE = "Написать в поддержку"
START_MESSAGE = (
    "Привет! Меня зовут Втордыш,"
    "и я помощник сотрудников фонда ВТОРОЕ ДЫХАНИЕ. "
    "Я создан для того, чтобы помочь новеньким адаптироваться, "
    "но также буду полезен и опытным сотрудникам.\n"
    "Чтобы продолжить, введи секретное слово."
)
FAILED_THE_TEST = (
    "У нас другое секретное слово."
    "Попробуй ввести его еще раз "
    "или обратись в HR-отдел Фонда или на почту hr@vtoroe.ru."
)
PASSED_THE_TEST = (
    "Верно! Выбери интересующую тебя тему из списка "
    "в меню и я помогу тебе найти нужную информацию."
)
STICKER_ID: str = (
    "CAACAgIAAxkBAAIDwGUEItYpuU5DXDRigDA1M9SL-AdcAALTJAACHRAwSj-yFNWnj6hDMAQ"
)

MENU_CONTACT_LIST_INPUT_FIO = (
    'Введи ФИО или должность нужного коллеги, и я пришлю тебе его контакты.'
)
MENU_CONTACT_LIST_LOAD_CONTACT_LIST = (
    'Если ты хочешь скачать справочник с контактами коллег, '
    'нажми на ссылку внизу(ссылку добавим позже)'
)
