STOP_MESSAGE = "Работа приложения остановлена."
HELP_MESSAGE = "Написать в поддержку"
START_MESSAGE = (
    "Привет! Меня зовут Втордыш,"
    "и я помощник сотрудников фонда ВТОРОЕ ДЫХАНИЕ. "
    "Я создан для того, чтобы помочь новеньким адаптироваться, "
    "но также буду полезен и опытным сотрудникам.\n"
    "Чтобы продолжить, введи секретное слово."
)
FAILED_THE_TEST = (
    "У нас другое секретное слово."
    "Попробуй ввести его еще раз "
    "или обратись в HR-отдел Фонда или на почту hr@vtoroe.ru."
)
PASSED_THE_TEST = (
    "Верно! Выбери интересующую тебя тему из списка "
    "в меню и я помогу тебе найти нужную информацию."
)
BACK_TO_THE_MENU = "Выбери интересующую тебя тему из списка:"
STICKER_ID: str = (
    "CAACAgIAAxkBAAIDwGUEItYpuU5DXDRigDA1M9SL-AdcAALTJAACHRAwSj-yFNWnj6hDMAQ"
)
BASIC_INFORMATION_MENU = (
    "В этом разделе мы собрали основную информацию о нашем Фонде.\n"
    "Выбирай нужный раздел, я расскажу про всё подробнее."
)
FUND_NEWS = (
    "Новости фонда\n"
    "Сайт фонда https://vtoroe.ru/\n"
    "Сайт магазинов https://shop.vtoroe.ru/\n"
    "Telegram фонда https://t.me/vtd_fond\n"
    "Telegram мастерской фонда https://t.me/vtoroemoscow\n"
    "Вконтакте фонда https://vk.com/vtd.fond\n"
)
OUR_TEAM_MESSAGE = (
    "У нас большая, дружная и сильная команда!"
    "Имена всех сотрудников с фотографиями можно найти "
    '<a href="https://vtoroe.ru/fond/people/">на нашем сайте</a>. '
    " Мы добавляем новых коллег на сайт после прохождения испытательного срока.\n"
    "\nТакже ты можешь посмотреть контакты всех сотрудников"
    ' в разделе "Список контактов" или почитать'
    ' об отделах Фонда в разделе "Отделы Фонда"'
)
# OUR_TEAM_SECOND_MESSAGE = (
#     'Также ты можешь посмотреть контакты всех сотрудников'
#     ' в разделе "Список контактов" или почитать'
#     ' об отделах Фонда в разделе "Отделы Фонда"'
# )
ORGANIZATION_MESSAGE = (
    "Как и в любой организации, в Фонде существует"
    ' <a href="https://docs.google.com/spreadsheets/d/1Wr8z0c1QtYvEl1nNX7oOt3LiaQ4ASNBhF2xxDDkpQs8/edit?usp=sharing">организационная структура</a>.'
    " Она состоит из совета, попечительского совета,"
    " директора, отделов и обособленных подразделений."
    " Головной офис фонда, мастерская, центр сортировки находятся в Москве,"
    " центр сортировки переработки, и центр гуманитарной выдачи – в г. Кострома."
    " Еще у Фонда есть склад в Ярославле.\n"
    "\nЕсли хочешь, я могу подробнее рассказать тебе о работе отделов или Совета."
)
COUNCIL_INTRODUCTION_MESSAGE = (
    "Это высший орган управления Фондом, "
    "возглавляемый Председателем Совета."
)
COUNCIL_ANSWER_01 = (
    "Совет решает следующие задачи (наиболее важное):\n"
    "- изменение и утверждение Устава Фонда;\n"
    "- избрание директора и досрочное прекращение его обязанностей;\n"
    "- избрание Попечительского совета фонда;\n"
    "- определение приоритетных направлений деятельности фонда;\n"
    "- утверждение благоприятных программ;\n"
    "- принятие решения о создании новых организаций (фондом);\n"
    "\n Более подробно прочитать о функциях Совета можно в"
    ' <a href="https://drive.google.com/file/d/1f8RUkEOUkyfq4D6UMcPlhOraxl1Bll9z/view?pli=1">Уставе фонда.</a>.'
)

COUNCIL_ANSWER_02 = (
    'Совет фонда определяет, куда двигается организация и использует '
    'свои ресурсы и связи для её развития. В хорошем смысле члены '
    'Совета - это "внешние раздражители". Их функция - приносить новые '
    'идеи, задавать неудобные вопросы, давать открытый свежий взгляд '
    'на перспективы и смотреть критически на процессы и не '
    '"закапываться" в рутине.'
)

COUNCIL_ANSWER_03 = (
    'Директор фонда - это единоличный исполнительный орган фонда. '
    'Он избирается Советом сроком на 5 лет и переизбирается '
    'неограниченное количествао раз. Директор обеспечивает '
    'решения Совета, готовит предложения по благотворительным '
    'программам фонда, решает вопросы финансовой и хозяйственной '
    'деятельности организации. Директор фонда "принимает управление" '
    'и руководит организацией, исходя из стратегии и видения, '
    'утверждённых Советом. Более подробно см. в Уставе.'
)

COUNCIL_ANSWER_04 = (
    'Директор фонда - это человек, который отвечает за все процессы '
    'и за то, чтобы была реализована стратегия. Председатель Совета '
    'не работает в фонде, не получает в нём зарплату и не вовлечён '
    'в ежедневные дела организации. Поэтому он не отвечает за '
    'процессы и реализацию стратегии, но он следит за выполнением '
    'KPI в рамках утверждённой стратегии, может выполнять '
    'антикризисную функцию (если что-то пошло не так). К началу 2022 '
    'года во "Втором дыхании" эти две функции не разделены, что '
    'приводит к конфликту интересов и мешает развитию.'
)

COUNCIL_ANSWER_05 = (
    'В Совет ВТОРОГО ДЫХАНИЯ вошли люди, которые поддерживали нас '
    'с самого начала работы организации. На начало 2022 года в '
    'Совет фонда входят Дарья Алексеева, Анастасия Гулявина, '
    'Вероника Жукова и Александр Фролов.В 2022 году запланирована '
    'ротация, которая подразумевает, что часть людей выйдет из '
    'Совета, а также в него добавятся новые члены. Это связано с '
    'тем, что за семь лет организация много раз меняла свою '
    'стратегию, появлялись новые проекты и направления деятельности '
    'и для успешного функционирования нам нужны новые члены Совета '
    'с другими знаниями и компетенциями. Председателем Совета '
    'останется текущий директор фонда Дарья Алексеева.'
)

COUNCIL_ANSWER_06 = (
    'Попечительский Совет (Попсовет) не вовлекается в '
    'стратегирование, но помогает своими ресурсами в продвижении '
    'фонда своим именем. Это не обязательно "звёзды эстрады": '
    'это лидеры мнений и эксперты в своей области, чья репутация '
    'и связи помогают в развитии организации.'
)

GARDIAN_COUNCIL_INTRODUCTION_MESSAGE = (
    'Попечительский Совет (Попсовет) не вовлекается в ' 
    'стратегирование, но помогает своими ресурсами в продвижении '
    'фонда своим именем. Это не обязательно "звёзды эстрады": '
    'это лидеры мнений и эксперты в своей области, чья репутация '
    'и связи помогают в развитии организации.'
)

DEPARTMENTS = 'Об отделах фонда.'

DEPARTMENT_01 = (
    'Реализация мероприятий фонда социальной направленности, '
    'коммуникация с партнёрскими благотворительными организациями.'
)

DEPARTMENT_02 = (
    'Информационные продукты фонда, волонтёрство, эколекции, '
    'профессиональная программа передачи опыта.'
)

DEPARTMENT_03 = (
    'Склад фонда в г. Москва. Сбор, хранение и сортировка одежды '
    'по категориям.'
)

DEPARTMENT_04 = (
    'Склад фонда в г. Кострома. Хранение, сортировка одежды и '
    'переработка.'
)

DEPARTMENT_05 = (
    'Оказание адресной вещевой помощи нуждающимся категориям '
    'граждан. Центр гуманитарной выдачи в Костроме работает '
    'по принципу бесплатного магазина.'
)

DEPARTMENT_06 = (
    'Расширение сети сбора одежды, установление внешних '
    'контактов, сбор информации и выстраивание отношений с '
    'партнёрами фонда, установка контейнеров для сбора одежды.'
)

DEPARTMENT_07 = (
    'Формирование и поддержка общей информационной стратегии '
    'фонда, создание привлекательного имиджа и устойчивой '
    'позитивной репутации, регулирование уровня информированности '
    'о деятельности фонда.'
)

DEPARTMENT_08 = (
    'Организация и управление финансовой деятельностью фонда, '
    'юридическое сопровождение деятельности фонда, организация '
    'и управление административно-хозяйственной деятельностью '
    'фонда.'
)

DEPARTMENT_09 = (
    'Организация и проведение мероприятий и мастер-классов, '
    'бесплатный швейный коворкинг.'
)

DEPARTMENT_10 = (
    'Поиск, адаптация, обучение и развитие сотрудников, кадровое '
    'делопроизводство, забота о сотрудниках.'
)

DEPARTMENT_LIST = [
    'department_01',
    'department_02',
    'department_03',
    'department_04',
    'department_05',
    'department_06',
    'department_07',
    'department_08',
    'department_09',
    'department_10',
]

COUNCIL_QUESTION_LIST = [
    'council_question_01',
    'council_question_02',
    'council_question_03',
    'council_question_04',
    'council_question_05',
    'council_question_06',
]
